# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here

import plotly.express as px

import seaborn as sns

import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
# your code here

temp = pd.read_csv('../data/Temp_states.csv')

#### Print `temp`.

In [6]:
# your code here

temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here

temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [8]:
"""
your comments here

City and State's type are object and temperature is float64.
"""

"\nyour comments here\n\nCity and State's type are object and temperature is float64.\n"

#### Select the rows where state is New York.

In [10]:
# your code here

temp_NY = temp.loc[temp['State'] == 'New York']

temp_NY

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [11]:
# your code here
temp_NY['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [12]:
# your code here
temp[['City','State']].loc[temp['Temperature'] > 15]

       City        State
0       NYC     New York
3  Hartford  Connecticut
5    Treton   New Jersey
6    Newark   New Jersey

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [13]:
# your code here

temp[['City']].loc[temp['Temperature'] > 15]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [14]:
# your code here
# Temperature >15 and <20
#NYC and Hartford

temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [15]:
#first attempt
temp['mean'] = [i.mean() for i in temp['Temperature']]

AttributeError: 'float' object has no attribute 'mean'

In [18]:
# your code here

temp = pd.read_csv('../data/Temp_states.csv')

In [19]:
temp.groupby(['State']).mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [20]:
temp.groupby(['State']).std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [21]:
# your code here

employees = pd.read_csv('../data/Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [22]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [23]:
"""
your comments here

Year and Salary are integers.

Other columns contains object values types.
"""

'\nyour comments here\n\nYear and Salary are integers.\n\nOther columns contains object values types.\n'

#### What's the average salary in this company?

In [24]:
# your code here

employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [25]:
# your code here

employees['Salary'].max()

70

#### What's the lowest salary?

In [26]:
# your code here
print(employees['Salary'].min())
employees.sort_values(['Salary'])

30

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
0    Jose         IT  Bachelor      M    analyst      1      35
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60
6  Carlos         IT    Master      M         VP      8      70
8     Ana         HR    Master      F         VP      8      70

#### Who are the employees with the lowest salary?

In [27]:
# your code here

employees[['Name']].loc[employees['Salary'] == 30]

    Name
1  Maria
2  David

#### Find all the information about an employee called David.

In [28]:
# your code here

employees.loc[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [29]:
# your code here

employees[['Salary']].loc[employees['Name']=='David']

   Salary
2      30

#### Print all the rows where job title is associate.

In [152]:
# your code here

employees.loc[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [153]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [160]:
# Method 2
# your code here

employees.loc[[0,1,2]]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [165]:
# your code here
employees.loc[(employees['Title'] == 'associate')&(employees['Salary'] >55) ]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [48]:
# your code here

employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [49]:
# your code here

employees.groupby('Title')[['Salary']].sum()

           Salary
Title
VP            140
analyst       130
associate     170

####  Find the salary quartiles.

In [53]:
# your code here

employees.groupby(['Salary']).quantile(0.25)

        Years
Salary
30        2.0
35        2.5
55        2.5
60        7.0
70        8.0

In [55]:
employees.groupby(['Salary']).quantile(0.5)

        Years
Salary
30        2.0
35        2.5
55        2.5
60        7.0
70        8.0

In [54]:
employees.groupby(['Salary']).quantile(0.75)

        Years
Salary
30       2.00
35       3.25
55       2.75
60       7.00
70       8.00

#### Is the mean salary different per gender?

In [57]:
# your code here

employees.groupby('Gender')[['Salary']].mean()

#yes

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [58]:
# your code here

employees.mean()

Years      4.111111
Salary    48.888889
dtype: float64

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here